---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.Space
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.Space

Places analytical spaces to account for the entire volume within the model. This includes rooms, plenums and chases.